docs/CS/Linux/Linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-10 Tue 15:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Shell commands:</a></li>
<li><a href="#orgheadline2">2. nano</a></li>
<li><a href="#orgheadline3">3. zsh</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Shell commands:</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>check python versions:</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">sudo find / -type f -executable -iname <span style="color: #E6DB74;">'python*'</span> -exec file -i <span style="color: #E6DB74;">'{}'</span> <span style="color: #E6DB74;">\;</span> | awk -F: <span style="color: #E6DB74;">'/x-executable; charset=binary/ {print $1}'</span> | xargs readlink -f | sort -u | xargs -I % sh -c <span style="color: #E6DB74;">'echo -n "%: "; % -V'</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">2</span>
ls -ls /usr/bin/python*
</pre>
</div>

<ul class="org-ul">
<li>unpack a tar.gz file</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #75715E;"># </span><span style="color: #75715E;">tar.gz</span>
tar -xvzf rebol.tar.gz

<span style="color: #75715E;">#</span><span style="color: #75715E;">*.gz</span>
</pre>
</div>

<ul class="org-ul">
<li>restart network service</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">sudo service network-manager restart
</pre>
</div>

<ul class="org-ul">
<li>chmod:</li>
</ul>
<p>
第一列共有10个位置，第一个字符指定了文件类型。在通常意义上，一个目录也是一个文件。如果第一个字符是横线，表示是一个非目录的文件。如果是d，表示是一个目录。从第二个字符开始到第十个共9个字符，3个字符一组，分别表示了3组用户对文件或者目录的权限。权限字符用横线代表空许可，r代表只读，w代表写，x代表可执行。
例如：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">&#12288;&#12288;- rw- r-- r--
</pre>
</div>

<p>
　　表示log2012.log是一个普通文件；log2012.log的属主有读写权限；与log2012.log属主同组的用户只有读权限；其他用户也只有读权限。
</p>

<ul class="org-ul">
<li>create symbolic link for a directory</li>
</ul>
<div class="org-src-container">

<pre class="src src-shell">ln -s /absolute/path/of/source/folder /absolute/path/of/target/folder
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> nano</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>光标控制 移动光标：使用用方向键移动。</li>
<li>选择文字：按住鼠标左键拖到。</li>
<li>复制、剪贴和粘贴</li>
<li>复制一整行：Alt+6</li>
<li>剪贴一整行：Ctrl+K</li>
<li>粘贴：Ctrl+U 如果需要复制／剪贴多行或者一行中的一部分，先将光标移动到需要复制／剪贴的文本的开头，按Ctrl+6（或者Alt+A）做标记，然后移动光标到 待复制／剪贴的文本末尾。这时选定的文本会反白，用Alt+6来复制，Ctrl+K来剪贴。若在选择文本过程中要取消，只需要再按一次Ctrl+6。</li>
<li>搜索 按Ctrl+W，然后输入你要搜索的关键字，回车确定。这将会定位到第一个匹配的文本，接着可以用Alt+W来定位到下一个匹配的文本。</li>
<li>翻页 Ctrl+Y到上一页 Ctrl+V到下一页</li>
<li>保存 使用Ctrl+O来保存所做的修改.</li>
<li>退出 按Ctrl+X 如果你修改了文件，下面会询问你是否需要保存修改。输入Y确认保存，输入N不保存，按Ctrl+C取消返回。如果输入了Y，下一步会让你输入想要保存的文件名。如果不需要修改文件名直接回车就行；若想要保存成别的名字（也就是另存为）则输入新名称然后确 定。这个时候也可用Ctrl+C来取消返回。</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">name</td>
<td class="org-left">shortcut</td>
</tr>

<tr>
<td class="org-left">标记</td>
<td class="org-left">Ctrl+6 / Alt+A</td>
</tr>

<tr>
<td class="org-left">复制整行</td>
<td class="org-left">Alt+6</td>
</tr>

<tr>
<td class="org-left">剪贴整行</td>
<td class="org-left">Ctrl+K</td>
</tr>

<tr>
<td class="org-left">粘贴</td>
<td class="org-left">Ctrl+U</td>
</tr>

<tr>
<td class="org-left">查找</td>
<td class="org-left">Ctrl+W (WhereIs)</td>
</tr>

<tr>
<td class="org-left">继续查找</td>
<td class="org-left">Alt+W</td>
</tr>

<tr>
<td class="org-left">上一页</td>
<td class="org-left">Ctrl+Y</td>
</tr>

<tr>
<td class="org-left">下一页</td>
<td class="org-left">Ctrl+V</td>
</tr>

<tr>
<td class="org-left">保存</td>
<td class="org-left">Ctrl+O</td>
</tr>

<tr>
<td class="org-left">退出</td>
<td class="org-left">Ctrl+X</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> zsh</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #75715E;"># </span><span style="color: #75715E;">If you come from bash you might have to change your $PATH.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">export PATH=$HOME/bin:/usr/local/bin:$PATH</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Path to your oh-my-zsh installation.</span>
  <span style="color: #F92672;">export</span> <span style="color: #FD971F;">ZSH</span>=/home/weiwu/.oh-my-zsh

<span style="color: #75715E;"># </span><span style="color: #75715E;">Set name of the theme to load. Optionally, if you set this to "random"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">it'll load a random theme each time that oh-my-zsh is loaded.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">See https://github.com/robbyrussell/oh-my-zsh/wiki/Themes</span>
<span style="color: #FD971F;">ZSH_THEME</span>=<span style="color: #E6DB74;">"robbyrussell"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">ZSH_THEME="agnoster"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">ZSH_THEME="pygmalion"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to use case-sensitive completion.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">CASE_SENSITIVE="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to use hyphen-insensitive completion. Case</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">sensitive completion must be off. _ and - will be interchangeable.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">HYPHEN_INSENSITIVE="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to disable bi-weekly auto-update checks.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">DISABLE_AUTO_UPDATE="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to change how often to auto-update (in days).</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">export UPDATE_ZSH_DAYS=13</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to disable colors in ls.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">DISABLE_LS_COLORS="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to disable auto-setting terminal title.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">DISABLE_AUTO_TITLE="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to enable command auto-correction.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">ENABLE_CORRECTION="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line to display red dots whilst waiting for completion.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">COMPLETION_WAITING_DOTS="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line if you want to disable marking untracked files</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">under VCS as dirty. This makes repository status check for large repositories</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">much, much faster.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">DISABLE_UNTRACKED_FILES_DIRTY="true"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Uncomment the following line if you want to change the command execution time</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">stamp shown in the history command output.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">The optional three formats: "mm/dd/yyyy"|"dd.mm.yyyy"|"yyyy-mm-dd"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">HIST_STAMPS="mm/dd/yyyy"</span>
<span style="color: #FD971F;">SAVEHIST</span>=<span style="color: #AE81FF;">1000000</span>
<span style="color: #FD971F;">HISTFILE</span>=~/.zsh_history

<span style="color: #75715E;"># </span><span style="color: #75715E;">Would you like to use another custom folder than $ZSH/custom?</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">ZSH_CUSTOM=/path/to/new-custom-folder</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Which plugins would you like to load? (plugins can be found in ~/.oh-my-zsh/plugins/*)</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Custom plugins may be added to ~/.oh-my-zsh/custom/plugins/</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Example format: plugins=(rails git textmate ruby lighthouse)</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Add wisely, as too many plugins slow down shell startup.</span>
<span style="color: #FD971F;">plugins</span>=<span style="color: #AE81FF;">(</span>git jump z<span style="color: #AE81FF;">)</span>

<span style="color: #F92672;">source</span> $<span style="color: #FD971F;">ZSH</span>/oh-my-zsh.sh

<span style="color: #75715E;"># </span><span style="color: #75715E;">User configuration</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">export MANPATH="/usr/local/man:$MANPATH"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">You may need to manually set your language environment</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">export LANG=en_US.UTF-8</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Preferred editor for local and remote sessions</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">if [[ -n $SSH_CONNECTION ]]; then</span>
<span style="color: #75715E;">#   </span><span style="color: #75715E;">export EDITOR='vim'</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">else</span>
<span style="color: #75715E;">#   </span><span style="color: #75715E;">export EDITOR='mvim'</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">fi</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Compilation flags</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">export ARCHFLAGS="-arch x86_64"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">ssh</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">export SSH_KEY_PATH="~/.ssh/rsa_id"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">Set personal aliases, overriding those provided by oh-my-zsh libs,</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">plugins, and themes. Aliases can be placed here, though oh-my-zsh</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">users are encouraged to define aliases within the ZSH_CUSTOM folder.</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">For a full list of active aliases, run `alias`.</span>
<span style="color: #75715E;">#</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">Example aliases</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">alias zshconfig="mate ~/.zshrc"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">alias ohmyzsh="mate ~/.oh-my-zsh"</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">XMODIFIERS</span>=<span style="color: #E6DB74;">"@im=fcitx"</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">GTK_IM_MODULE</span>=xim
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">QT_IM_MODULE</span>=xim
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">LC_CTYPE</span>=zh_CN.UTF-8

<span style="color: #75715E;"># </span><span style="color: #75715E;">path</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PATH</span>=$<span style="color: #FD971F;">HOME</span>/Tools/google_appengine:$<span style="color: #FD971F;">PATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">LD_LIBRARY_PATH</span>=/usr/local/lib:$<span style="color: #FD971F;">LD_LIBRARY_PATH</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">emacs</span>
<span style="color: #F92672;">alias</span> <span style="color: #FD971F;">ec</span>=<span style="color: #E6DB74;">'emacsclient -nc -a ""'</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">EDITOR</span>=<span style="color: #E6DB74;">"emacsclient"</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">cpp</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">CPLUS_INCLUDE_PATH</span>=$<span style="color: #FD971F;">HOME</span>/github/rlib-cpp:$<span style="color: #FD971F;">HOME</span>/github/ib-tws-trade:$<span style="color: #FD971F;">HOME</span>/github/ib-tws-trade/PosixClient/Shared:$<span style="color: #FD971F;">CPLUS_INCLUDE_PATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">GTAGSLIBPATH</span>=$<span style="color: #FD971F;">HOME</span>/.gtags/
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">AG_STRATEGY</span>=$<span style="color: #FD971F;">HOME</span>/projects/ag-strategy:$<span style="color: #FD971F;">AG_STRATEGY</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">node</span>
<span style="color: #F92672;">alias</span> <span style="color: #FD971F;">npm</span>=<span style="color: #E6DB74;">'npm --registry=https://registry.npm.taobao.org'</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">python</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">export PYENV_ROOT="$HOME/.pyenv"</span>

<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYTHONPATH</span>=/usr/local/lib/python2.7/:$<span style="color: #FD971F;">PYTHONPATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYTHONPATH</span>=$<span style="color: #FD971F;">HOME</span>/projects/tradehub/src/py/:$<span style="color: #FD971F;">PYTHONPATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYTHONPATH</span>=$<span style="color: #FD971F;">HOME</span>/projects/simulate/:$<span style="color: #FD971F;">PYTHONPATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYTHONPATH</span>=$<span style="color: #FD971F;">HOME</span>/tools/WaveFront/PythonScripts/:$<span style="color: #FD971F;">PYTHONPATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYTHONPATH</span>=$<span style="color: #FD971F;">HOME</span>/projects/ylib-py/:$<span style="color: #FD971F;">PYTHONPATH</span>
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYENV_VIRTUALENVWRAPPER_PREFER_PYVENV</span>=<span style="color: #E6DB74;">"true"</span>

<span style="color: #75715E;">#</span><span style="color: #75715E;">export PATH="$PYENV_ROOT/bin:$PATH"</span>

<span style="color: #75715E;">#</span><span style="color: #75715E;">pyenv virtualenvwrapper</span>

<span style="color: #75715E;">#</span><span style="color: #75715E;">export VIRTUALENVWRAPPER_PYTHON=/usr/bin/python</span>

<span style="color: #F92672;">source</span> /usr/local/bin/virtualenvwrapper.sh
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PYENV_ROOT</span>=$<span style="color: #FD971F;">HOME</span>/.pyenv
<span style="color: #F92672;">export</span> <span style="color: #FD971F;">PATH</span>=$<span style="color: #FD971F;">PYENV_ROOT</span>/bin:$<span style="color: #FD971F;">PATH</span>
<span style="color: #F92672;">eval</span> <span style="color: #E6DB74;">"$(pyenv init -)"</span>

<span style="color: #75715E;">#</span><span style="color: #75715E;">export PATH="$PYENV_ROOT/bin:$PATH</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">eval "$(pyenv init -)"</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">pyenv virtualenvwrapper</span>

<span style="color: #F92672;">export</span> <span style="color: #FD971F;">VIRTUALENVWRAPPER_PYTHON</span>=/usr/bin/python


<span style="color: #75715E;"># </span><span style="color: #75715E;">The next line updates PATH for the Google Cloud SDK.</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">[</span> -f <span style="color: #E6DB74;">'/home/weiwu/projects/sentiment/google-cloud-sdk/path.zsh.inc'</span> <span style="color: #AE81FF;">]</span>; <span style="color: #F92672;">then </span><span style="color: #F92672;">source</span> <span style="color: #E6DB74;">'/home/weiwu/projects/sentiment/google-cloud-sdk/path.zsh.inc'</span>; <span style="color: #F92672;">fi</span>

<span style="color: #75715E;"># </span><span style="color: #75715E;">The next line enables shell command completion for gcloud.</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">[</span> -f <span style="color: #E6DB74;">'/home/weiwu/projects/sentiment/google-cloud-sdk/completion.zsh.inc'</span> <span style="color: #AE81FF;">]</span>; <span style="color: #F92672;">then </span><span style="color: #F92672;">source</span> <span style="color: #E6DB74;">'/home/weiwu/projects/sentiment/google-cloud-sdk/completion.zsh.inc'</span>; <span style="color: #F92672;">fi</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
